app/Controllers/Employee.php

SELECT *
FROM `users`
WHERE `id` = 1
 LIMIT 1
---
    private function userDetails(int $uid): array
    {
        $row = db_connect()
            ->table('users')
            ->where('id', $uid)
            ->limit(1)
            ->get()->getRowArray();