app/Controllers/Home.php

	private function userDetails(int $uid): array
    {
        $row = db_connect()
            ->table('users')
            ->where('id', $uid)
            ->limit(1)
            ->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = 1
 LIMIT 1

	public function checkValidUser()
	{
		$session = session();
		$userModel = new UserModel();

		$email = trim((string) $this->request->getPost('employee_id'));
		$password = (string) $this->request->getPost('password');

		// Basic input hardening
		if ($email === '' || $password === '') {
			$session->setFlashdata('errorMsg', 'Please enter Email and Password.');
			return redirect()->to(base_url('login'));
		}

		$user = $userModel->where('employee_id', $email)->first();
---
SELECT *
FROM `users`
WHERE `employee_id` = 'IBWB700071'
 LIMIT 1

	public function dashboard()
	{
		if ($r = $this->requireLogin()) return $r;
        $uid        = $this->uid();
    	$userDetails  = $this->userDetails($uid);
		$data = [
            'title'    => 'WELFARE | DASHBOARD',
			'active_menu' => 'dashboard',
            'allUsers' => db_connect()->table('users')->where('id !=', $uid)->where('status', 'Active')->get()->getResultArray(),
---
SELECT *
FROM `users`
WHERE `id` != 1
AND `status` = 'Active'